This PartMaker refers to parts which cannot be merged.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId PartsCannotBeMerged { get; }
  Visual Basic
Public Shared ReadOnly Property PartsCannotBeMerged As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ PartsCannotBeMerged {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures PartMakerMethodForMergePartFailures Class
  Autodesk.Revit.DB Namespace